app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Wed, 01 Apr 2015 02:52:47 UTC +00:00], ["updated_at", Wed, 01 Apr 2015 02:52:47 UTC +00:00], ["username", "brownie"]]